month_num = input("Введите месяц в виде целого числа от 1 до 12: ")

ls = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
print(ls[int(month_num)-1])

season_dict = {"1": "зима",
               "2": "зима",
               "3": "весна",
               "4": "весна",
               "5": "весна",
               "6": "лето",
               "7": "лето",
               "8": "лето",
               "9": "осень",
               "10": "осень",
               "11": "осень",
               "12": "зима"}
print(season_dict[month_num])
